using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp1
{
    internal class Class3
    {

        //Напишите программу, которая запрашивает 
        //            //    у пользователя число и затем проверяет,
        //            //    является ли оно палиндромом(то есть числом
        //            //        , которое читается одинаково как справа
        //            //        налево, так и слева направо).

        //            string num = Console.ReadLine().Trim();
        //            string ttr = string.Join("", num.Reverse());
        //            if(num==ttr)
        //            {
        //                Console.WriteLine($"{num}- number is palindrom");
        //            }
        //            else
        //            {
        //                Console.WriteLine($"{num}- number is not palindrom");

        //            }
    }
}
